WcfHarness/WcfHarness/RequestXmls/ResetPassword.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <ResetPassword xmlns="http://www.tavisca.com/Vexiere/IIdentity/2013/01">
      <resetPasswordRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:NewPassword>xsw2XSW@</a:NewPassword>
        <a:Passcode>ODNjY2RmNjQtNjJkMC00MzgwLTg4ZmMtMjVlOTg4YzE2ODQw</a:Passcode>
      </resetPasswordRequest>
    </ResetPassword>
  </s:Body>
</s:Envelope>